In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
frame = pd.read_clipboard()

In [8]:
frame

                      a        dt         b
0 -0.713356  2015-10-01  00:00:00 -0.159170
1 -1.636397  2015-10-01  00:30:00 -1.038110
2 -1.390117  2015-10-01  01:00:00 -1.124016

In [9]:
frame.columns

Index(['a', 'dt', 'b'], dtype='object')

In [10]:
frame['dt']

0  -0.713356    00:00:00
1  -1.636397    00:30:00
2  -1.390117    01:00:00
Name: dt, dtype: object

In [12]:
frame[['a', 'b']]

                      a         b
0 -0.713356  2015-10-01 -0.159170
1 -1.636397  2015-10-01 -1.038110
2 -1.390117  2015-10-01 -1.124016

In [13]:
frame

                      a        dt         b
0 -0.713356  2015-10-01  00:00:00 -0.159170
1 -1.636397  2015-10-01  00:30:00 -1.038110
2 -1.390117  2015-10-01  01:00:00 -1.124016

In [14]:
DataFrame(frame, columns = ['a', 'b'])

                      a         b
0 -0.713356  2015-10-01 -0.159170
1 -1.636397  2015-10-01 -1.038110
2 -1.390117  2015-10-01 -1.124016

In [17]:
frame.head(2)

                      a        dt        b
0 -0.713356  2015-10-01  00:00:00 -0.15917
1 -1.636397  2015-10-01  00:30:00 -1.03811

In [18]:
frame.tail(2)

                      a        dt         b
1 -1.636397  2015-10-01  00:30:00 -1.038110
2 -1.390117  2015-10-01  01:00:00 -1.124016

In [21]:
frame.loc[1]

                    a        dt        b
-1.636397  2015-10-01  00:30:00 -1.03811

In [22]:
frame['c'] = 'foo'

In [23]:
frame

                      a        dt         b    c
0 -0.713356  2015-10-01  00:00:00 -0.159170  foo
1 -1.636397  2015-10-01  00:30:00 -1.038110  foo
2 -1.390117  2015-10-01  01:00:00 -1.124016  foo

In [24]:
frame['c'] = np.arange(3)

In [25]:
frame

                      a        dt         b  c
0 -0.713356  2015-10-01  00:00:00 -0.159170  0
1 -1.636397  2015-10-01  00:30:00 -1.038110  1
2 -1.390117  2015-10-01  01:00:00 -1.124016  2

In [36]:
dcol = Series([9,8], index = [0, 2])

In [37]:
frame['d'] = dcol

In [38]:
frame

                      a        dt         b  c   d
0 -0.713356  2015-10-01  00:00:00 -0.159170  0 NaN
1 -1.636397  2015-10-01  00:30:00 -1.038110  1 NaN
2 -1.390117  2015-10-01  01:00:00 -1.124016  2 NaN

In [39]:
d

0    9
2    8
dtype: int64

In [40]:
data = {'air': ['HND', 'KIX', 'NRT'], 'foo': [11, 22, 33]}

In [41]:
data

{'air': ['HND', 'KIX', 'NRT'], 'foo': [11, 22, 33]}

In [42]:
air_frame = DataFrame(data)

In [43]:
air_frame

   air  foo
0  HND   11
1  KIX   22
2  NRT   33

In [44]:
air_frame['d'] = dcol

In [45]:
air_frame

   air  foo    d
0  HND   11  9.0
1  KIX   22  NaN
2  NRT   33  8.0